---
kind: method
id: M:Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetDocument
source: html/7564b620-be0b-971c-1dd9-2c2061e02fec.htm
---
# Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetDocument Method

Returns document associated with this event

## Syntax (C#)
```csharp
public Document GetDocument()
```

## Returns
The document associated with this event.